index.org
#+TITLE: MarkWhite Personal Wiki
#+HTML_HEAD: <link rel="stylesheet" href="http://markwh1te.github.io/org.css" type="text/css" >
#+OPTIONS:  ^:nil 

* Python
** [[file:syntax.org][syntax]]
** [[file:django.org][django]]
** [[file:flask.org][flask]]
** [[file:celery.org][celery]]
** [[file:library.org][library]]
* Emacs
** spacemacs
*** [[https://github.com/syl20bnr/spacemacs/tree/master/layers][view layers doc]]
*** [[https://github.com/syl20bnr/spacemacs/tree/master/layers/%2Btags][tags]]
** vim shortcut
** org mode
* Linux 
** [[file:shell.org][shell]]
** [[file:app_config.org][app_config]]
** [[http://stackoverflow.com/questions/5656530/how-to-use-shared-memory-with-linux-in-c][memory]]
* Database
** [[file:mysql.org][mysql]]
** [[file:mongodb.org][mongoDB]]
* Internet
** [[https://zh.wikipedia.org/wiki/%E6%96%87%E4%BB%B6%E6%8F%8F%E8%BF%B0%E7%AC%A6][File descriptor]]
** proxychains
**** [[http://huifeng.me/2015/08/23/ProxyChains-NG-4-OSX-Setting/][proxychains]]
**** [[https://github.com/rofl0r/proxychains-ng][git]]
** [[https://en.wikipedia.org/wiki/Java_servlet][java servlet]]
* Algorithms
** [[http://d0evi1.com/wang-jenkins-hash/][jenkins hash]]
** algorithms
** text book and website
* AI
** [[file:npl.org][npl]]
** [[file:tensorflow.org][tensorflow]]
* Life
** what worth fighting for
** good youtube vedio
* Scheme
** list 
* Math
** [[https://en.wikipedia.org/wiki/Horner%27s_method][horner's rule]]
   說白了就是瘋狂對 x 提取公因子
# todo
** 多项式公式
* resume
** [[file:resume.org][resume]]
* uncollected
** [[file:uncollected.org][uncollected]]
* good quotes
  “If you learn only methods, you’ll be tied to your methods. But if you learn principles, you can devise your own methods.” —Ralph Waldo Emerson
