index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-12-02 Fri 18:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>MarkWhite Personal Wiki</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="mark-linux" />
<link rel="stylesheet" href="http://markwh1te.github.io/org.css" type="text/css" >
</head>
<body>
<div id="content">
<h1 class="title">MarkWhite Personal Wiki</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org16fc806">1. Python</a>
<ul>
<li><a href="#org6bd7fc2">1.1. syntax</a></li>
<li><a href="#org46534c5">1.2. django</a></li>
<li><a href="#orgd96d8e0">1.3. flask</a></li>
<li><a href="#org5221f41">1.4. celery</a></li>
<li><a href="#org7fa1705">1.5. library</a></li>
</ul>
</li>
<li><a href="#org1cdc681">2. Emacs</a>
<ul>
<li><a href="#orgf5ac0ec">2.1. spacemacs</a>
<ul>
<li><a href="#org77dc2ff">2.1.1. view layers doc</a></li>
<li><a href="#org298aede">2.1.2. tags</a></li>
</ul>
</li>
<li><a href="#org593297f">2.2. vim shortcut</a></li>
<li><a href="#orgae6b775">2.3. org mode</a></li>
</ul>
</li>
<li><a href="#org5ceff98">3. Linux</a>
<ul>
<li><a href="#org4bc0799">3.1. shell</a></li>
<li><a href="#org1e81684">3.2. app_config</a></li>
<li><a href="#org9317976">3.3. memory</a></li>
</ul>
</li>
<li><a href="#org206b429">4. Database</a>
<ul>
<li><a href="#org2488236">4.1. mysql</a></li>
<li><a href="#org37737dd">4.2. mongoDB</a></li>
</ul>
</li>
<li><a href="#org7097ea0">5. Internet</a>
<ul>
<li><a href="#orgb7074fb">5.1. File descriptor</a></li>
<li><a href="#org9b2dd49">5.2. proxychains</a></li>
<li><a href="#org7be1d34">5.3. java servlet</a></li>
</ul>
</li>
<li><a href="#org6fe1f64">6. Algorithms</a>
<ul>
<li><a href="#orgfcc3876">6.1. jenkins hash</a></li>
<li><a href="#orge684b8a">6.2. algorithms</a></li>
<li><a href="#org5d8ee34">6.3. text book and website</a></li>
</ul>
</li>
<li><a href="#org2591d45">7. AI</a>
<ul>
<li><a href="#org89d2348">7.1. npl</a></li>
<li><a href="#org29a11fc">7.2. tensorflow</a></li>
</ul>
</li>
<li><a href="#orgf7d6b95">8. Life</a>
<ul>
<li><a href="#orge3efd25">8.1. what worth fighting for</a></li>
<li><a href="#org66adc72">8.2. good youtube vedio</a></li>
</ul>
</li>
<li><a href="#orgc2fd783">9. Scheme</a>
<ul>
<li><a href="#org9e7542d">9.1. list</a></li>
</ul>
</li>
<li><a href="#orgeeeae56">10. Math</a>
<ul>
<li><a href="#org8c36046">10.1. horner's rule</a></li>
<li><a href="#orgf3f1ebb">10.2. 多项式公式</a></li>
</ul>
</li>
<li><a href="#orgb69c09a">11. resume</a>
<ul>
<li><a href="#org770e35b">11.1. resume</a></li>
</ul>
</li>
<li><a href="#org265b3c2">12. uncollected</a>
<ul>
<li><a href="#org806ff21">12.1. uncollected</a></li>
</ul>
</li>
<li><a href="#org247e2c2">13. good quotes</a></li>
</ul>
</div>
</div>

<div id="outline-container-org16fc806" class="outline-2">
<h2 id="org16fc806"><span class="section-number-2">1</span> Python</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-org6bd7fc2" class="outline-3">
<h3 id="org6bd7fc2"><span class="section-number-3">1.1</span> <a href="syntax.html">syntax</a></h3>
</div>
<div id="outline-container-org46534c5" class="outline-3">
<h3 id="org46534c5"><span class="section-number-3">1.2</span> <a href="django.html">django</a></h3>
</div>
<div id="outline-container-orgd96d8e0" class="outline-3">
<h3 id="orgd96d8e0"><span class="section-number-3">1.3</span> <a href="flask.html">flask</a></h3>
</div>
<div id="outline-container-org5221f41" class="outline-3">
<h3 id="org5221f41"><span class="section-number-3">1.4</span> <a href="celery.html">celery</a></h3>
</div>
<div id="outline-container-org7fa1705" class="outline-3">
<h3 id="org7fa1705"><span class="section-number-3">1.5</span> <a href="library.html">library</a></h3>
</div>
</div>
<div id="outline-container-org1cdc681" class="outline-2">
<h2 id="org1cdc681"><span class="section-number-2">2</span> Emacs</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgf5ac0ec" class="outline-3">
<h3 id="orgf5ac0ec"><span class="section-number-3">2.1</span> spacemacs</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-org77dc2ff" class="outline-4">
<h4 id="org77dc2ff"><span class="section-number-4">2.1.1</span> <a href="https://github.com/syl20bnr/spacemacs/tree/master/layers">view layers doc</a></h4>
</div>
<div id="outline-container-org298aede" class="outline-4">
<h4 id="org298aede"><span class="section-number-4">2.1.2</span> <a href="https://github.com/syl20bnr/spacemacs/tree/master/layers/+tags">tags</a></h4>
</div>
</div>
<div id="outline-container-org593297f" class="outline-3">
<h3 id="org593297f"><span class="section-number-3">2.2</span> vim shortcut</h3>
</div>
<div id="outline-container-orgae6b775" class="outline-3">
<h3 id="orgae6b775"><span class="section-number-3">2.3</span> org mode</h3>
</div>
</div>
<div id="outline-container-org5ceff98" class="outline-2">
<h2 id="org5ceff98"><span class="section-number-2">3</span> Linux</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-org4bc0799" class="outline-3">
<h3 id="org4bc0799"><span class="section-number-3">3.1</span> <a href="shell.html">shell</a></h3>
</div>
<div id="outline-container-org1e81684" class="outline-3">
<h3 id="org1e81684"><span class="section-number-3">3.2</span> <a href="app_config.html">app_config</a></h3>
</div>
<div id="outline-container-org9317976" class="outline-3">
<h3 id="org9317976"><span class="section-number-3">3.3</span> <a href="http://stackoverflow.com/questions/5656530/how-to-use-shared-memory-with-linux-in-c">memory</a></h3>
</div>
</div>
<div id="outline-container-org206b429" class="outline-2">
<h2 id="org206b429"><span class="section-number-2">4</span> Database</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-org2488236" class="outline-3">
<h3 id="org2488236"><span class="section-number-3">4.1</span> <a href="mysql.html">mysql</a></h3>
</div>
<div id="outline-container-org37737dd" class="outline-3">
<h3 id="org37737dd"><span class="section-number-3">4.2</span> <a href="mongodb.html">mongoDB</a></h3>
</div>
</div>
<div id="outline-container-org7097ea0" class="outline-2">
<h2 id="org7097ea0"><span class="section-number-2">5</span> Internet</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-orgb7074fb" class="outline-3">
<h3 id="orgb7074fb"><span class="section-number-3">5.1</span> <a href="https://zh.wikipedia.org/wiki/%E6%96%87%E4%BB%B6%E6%8F%8F%E8%BF%B0%E7%AC%A6">File descriptor</a></h3>
</div>
<div id="outline-container-org9b2dd49" class="outline-3">
<h3 id="org9b2dd49"><span class="section-number-3">5.2</span> proxychains</h3>
<div class="outline-text-3" id="text-5-2">
</div><ol class="org-ol"><li><a id="org2f84dd1"></a><a href="http://huifeng.me/2015/08/23/ProxyChains-NG-4-OSX-Setting/">proxychains</a><br  /></li>
<li><a id="orgf0d7256"></a><a href="https://github.com/rofl0r/proxychains-ng">git</a><br  /></li></ol>
</div>
<div id="outline-container-org7be1d34" class="outline-3">
<h3 id="org7be1d34"><span class="section-number-3">5.3</span> <a href="https://en.wikipedia.org/wiki/Java_servlet">java servlet</a></h3>
</div>
</div>
<div id="outline-container-org6fe1f64" class="outline-2">
<h2 id="org6fe1f64"><span class="section-number-2">6</span> Algorithms</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-orgfcc3876" class="outline-3">
<h3 id="orgfcc3876"><span class="section-number-3">6.1</span> <a href="http://d0evi1.com/wang-jenkins-hash/">jenkins hash</a></h3>
</div>
<div id="outline-container-orge684b8a" class="outline-3">
<h3 id="orge684b8a"><span class="section-number-3">6.2</span> algorithms</h3>
</div>
<div id="outline-container-org5d8ee34" class="outline-3">
<h3 id="org5d8ee34"><span class="section-number-3">6.3</span> text book and website</h3>
</div>
</div>
<div id="outline-container-org2591d45" class="outline-2">
<h2 id="org2591d45"><span class="section-number-2">7</span> AI</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-org89d2348" class="outline-3">
<h3 id="org89d2348"><span class="section-number-3">7.1</span> <a href="npl.html">npl</a></h3>
</div>
<div id="outline-container-org29a11fc" class="outline-3">
<h3 id="org29a11fc"><span class="section-number-3">7.2</span> <a href="tensorflow.html">tensorflow</a></h3>
</div>
</div>
<div id="outline-container-orgf7d6b95" class="outline-2">
<h2 id="orgf7d6b95"><span class="section-number-2">8</span> Life</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-orge3efd25" class="outline-3">
<h3 id="orge3efd25"><span class="section-number-3">8.1</span> what worth fighting for</h3>
</div>
<div id="outline-container-org66adc72" class="outline-3">
<h3 id="org66adc72"><span class="section-number-3">8.2</span> good youtube vedio</h3>
</div>
</div>
<div id="outline-container-orgc2fd783" class="outline-2">
<h2 id="orgc2fd783"><span class="section-number-2">9</span> Scheme</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-org9e7542d" class="outline-3">
<h3 id="org9e7542d"><span class="section-number-3">9.1</span> list</h3>
</div>
</div>
<div id="outline-container-orgeeeae56" class="outline-2">
<h2 id="orgeeeae56"><span class="section-number-2">10</span> Math</h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-org8c36046" class="outline-3">
<h3 id="org8c36046"><span class="section-number-3">10.1</span> <a href="https://en.wikipedia.org/wiki/Horner's_method">horner's rule</a></h3>
<div class="outline-text-3" id="text-10-1">
<p>
說白了就是瘋狂對 x 提取公因子
</p>
</div>
</div>

<div id="outline-container-orgf3f1ebb" class="outline-3">
<h3 id="orgf3f1ebb"><span class="section-number-3">10.2</span> 多项式公式</h3>
</div>
</div>
<div id="outline-container-orgb69c09a" class="outline-2">
<h2 id="orgb69c09a"><span class="section-number-2">11</span> resume</h2>
<div class="outline-text-2" id="text-11">
</div><div id="outline-container-org770e35b" class="outline-3">
<h3 id="org770e35b"><span class="section-number-3">11.1</span> <a href="resume.html">resume</a></h3>
</div>
</div>
<div id="outline-container-org265b3c2" class="outline-2">
<h2 id="org265b3c2"><span class="section-number-2">12</span> uncollected</h2>
<div class="outline-text-2" id="text-12">
</div><div id="outline-container-org806ff21" class="outline-3">
<h3 id="org806ff21"><span class="section-number-3">12.1</span> <a href="uncollected.html">uncollected</a></h3>
</div>
</div>
<div id="outline-container-org247e2c2" class="outline-2">
<h2 id="org247e2c2"><span class="section-number-2">13</span> good quotes</h2>
<div class="outline-text-2" id="text-13">
<p>
“If you learn only methods, you’ll be tied to your methods. But if you learn principles, you can devise your own methods.” —Ralph Waldo Emerson
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: mark-linux</p>
<p class="date">Created: 2016-12-02 Fri 18:48</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
